In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({
    'city': ['New York', 'London', 'Paris', 'Tokyo', 'New York', 'Paris'],
    'price': [200, 150, 300, 250, 180, 320]
})

In [3]:
df

       city  price
0  New York    200
1    London    150
2     Paris    300
3     Tokyo    250
4  New York    180
5     Paris    320

In [8]:
mean_price=df.groupby('city')['price'].mean().to_dict()

In [9]:
mean_price

{'London': 150.0, 'New York': 190.0, 'Paris': 310.0, 'Tokyo': 250.0}

In [11]:
df['encoded_city']=df['city'].map(mean_price)

In [13]:
df[['encoded_city','price']]

   encoded_city  price
0         190.0    200
1         150.0    150
2         310.0    300
3         250.0    250
4         190.0    180
5         310.0    320

##do with another dataset
##tips dataset

In [15]:
import seaborn as sns

In [17]:
df=sns.load_dataset('tips')

In [18]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [19]:
df1=df[['total_bill','time']]

In [25]:
mean_price=df1.groupby('time')['total_bill'].mean().to_dict()

In [26]:
mean_price

{'Lunch': 17.168676470588235, 'Dinner': 20.79715909090909}

In [28]:
df['time_encoded']=df1['time'].map(mean_price)

In [30]:
df[['time_encoded','total_bill']]

    time_encoded  total_bill
0      20.797159       16.99
1      20.797159       10.34
2      20.797159       21.01
3      20.797159       23.68
4      20.797159       24.59
..           ...         ...
239    20.797159       29.03
240    20.797159       27.18
241    20.797159       22.67
242    20.797159       17.82
243    20.797159       18.78

[244 rows x 2 columns]